// src/constants/index.ts
export const ACTIVITY_TOOLS = ["노방", "지인", "온라인", "기타"];

export const REGION_MAP: Record<string, string[]> = {
    "자문": ["1지역", "2지역", "3지역", "4지역", "5지역", "6지역", "7지역", "8지역", "9지역", "10지역", "11지역" ],
    "장년": ["보라매", "목동", "홍대", "영등포", "숭실"],
    "부녀": ["보라매", "목동", "홍대", "영등포", "숭실", "노량진", "서울대"],
    "청년": ["보라매1", "보라매2", "목동", "홍대", "영등포", "숭실", "노량진", "대학부", "문래", "새신자", "새신자부", "국제", "여의도"],
    "교역": ["중진", "교회", "센터"],
    "미배정": ["-"]
};

export const DEPARTMENT24_LIST =[
    "행정서무부",
    "내무부",
    "기획부",
    "재정부",
    "교육부",
    "신학부",
    "해외선교부",
    "문화부",
    "출판부",
    "정보통신부",
    "찬양부",
    "섭외부",
    "국선부",
    "홍보부",
    "법무부",
    "건설부",
    "체육부",
    "사업부",
    "보건후생복지부",
    "봉사교통부",
    "학생회",
    "유년회",
    "여성부",
    "하늘단체"
];
export const CENTER_LIST =["보라매센터", "목동센터", "영등포센터", "숭실대센터", "노량진센터", "여의도센터"];